<h2>Transactions</h2>

In [2]:
import pymysql

In [3]:
%load_ext sql
%sql mysql+pymysql://root:eitapreulasql@127.0.0.1:3306

In [4]:
%%sql
use bank;
select database();

 * mysql+pymysql://root:***@127.0.0.1:3306
0 rows affected.
1 rows affected.

[('bank',)]

In [5]:
%%sql
show tables;

 * mysql+pymysql://root:***@127.0.0.1:3306
2 rows affected.

[('bankaccounts',), ('shoeshop',)]

In [9]:
%%sql
select * from bankaccounts;

 * mysql+pymysql://root:***@127.0.0.1:3306
4 rows affected.

[('B001', 'Rose', Decimal('300.00')),
 ('B002', 'James', Decimal('1345.00')),
 ('B003', 'Shoe Shop', Decimal('124200.00')),
 ('B004', 'Corner Shop', Decimal('76000.00'))]

In [8]:
%%sql
select * from shoeshop;

 * mysql+pymysql://root:***@127.0.0.1:3306
4 rows affected.

[('Boots', 11, Decimal('200.00')),
 ('Brogues', 10, Decimal('150.00')),
 ('High heels', 8, Decimal('600.00')),
 ('Trainers', 14, Decimal('300.00'))]

Imagine Rose is buying a pair of boots from ShoeShop. So we have to update Rose's balance as well as the ShoeShop balance in the BankAccounts table. Then we also have to update Boots stock in the ShoeShop table. After Boots, let's also attempt to buy Rose a pair of Trainers.

In [17]:
%%sql

create procedure transaction_rose()
begin
    declare exit handler for sqlexception 
    begin
        rollback;
        resignal;
    end;

    start transaction;

    update BankAccounts
    set balance = balance - 200
    where AccountName = 'Rose';

    update BankAccounts
    set balance = balance + 200
    where AccountName = 'Shoe Shop';

    update ShoeShop
    set stock = stock - 1
    where product = 'boots';

    update BankAccounts
    set balance = balance - 300
    where AccoUntName = 'Rose';

    commit;
end

 * mysql+pymysql://root:***@127.0.0.1:3306
0 rows affected.

[]

In [18]:
%sql call transaction_rose;

 * mysql+pymysql://root:***@127.0.0.1:3306
(pymysql.err.OperationalError) (3819, "Check constraint 'bankaccounts_chk_1' is violated.")
[SQL: call transaction_rose;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

Notice that the last update statement tries to buy Rose a pair of Trainers, but her balance becomes insufficient after buying a pair of boots. So, the last update statement fails. 

Since the whole transaction fails if any of the sql statements fail, the transaction won't be commited.

Let's now create a new stored procedure name transaction_james to execute a transaction based on the following scenario. First buy James 4 pair of Trainers from ShoesShopÂ´. Update his balance as well as the balance of ShoeShop. We are also have to update the stock of Trainers at ShoeShop. Then attempt to buy James a pair of Brogues from ShoeShop.

In [25]:
%%sql

create procedure transaction_james()

begin
    declare exit handler for sqlexception
    begin
        rollback;
        resignal;
    end;

    start transaction;
    
    update BankAccounts
    set balance = balance - 4 * 300
    where AccountName = 'James';

    update BankAccounts
    set balance = balance + 4 * 300
    where AccountName = 'Shoe Shop';

    update ShoeShop
    set stock = stock - 4 
    where product = 'Trainers';

    update BankAccounts
    set balance = balance - 150
    where AccountName = 'James';

    commit;
end

 * mysql+pymysql://root:***@127.0.0.1:3306
0 rows affected.

[]

In [26]:
%%sql

call transaction_james;

 * mysql+pymysql://root:***@127.0.0.1:3306
(pymysql.err.OperationalError) (3819, "Check constraint 'bankaccounts_chk_1' is violated.")
[SQL: call transaction_james;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

So the transaction has been rolled back, wich means one of the updates has failed. The transaction will only be commited if the whole transaction is successful.